{
  "site": {
    "title": "Apiros3",
    "description": "Main",
    "author": "Apiros3"
  },
  "about": {
    "title": "About Me",
    "content": "Welcome! I am Tadayoshi Kamegai, a 4th year undergraduate student at Merton College, University of Oxford studying mathematics and computer science. My general interests lie in Type Theory and surrounding fields.\n\nI'm currently looking for PhD positions related to Type Theory. If you have any recommendations, please feel free to reach out to me at tadayoshi [dot] kamegai [at] merton [dot] ox [dot] ac [dot] uk.\n\nThis summer I am working as an intern at ELTE under Ambrus Kaposi on works related to GATs. I'm also working as a Research Assistant under Nobuko Yoshida (officially employed in summer 2024 and spring 2025) in the Mobility Reading Group at Oxford, mechanising the metatheory of session types in Coq. I'm also reading works related to modal logic with Daniel Gratzer right now. My Master's thesis will be on linear logic in dependent type theory with Maximilian Doré. You can usually see what kind of work I've been reading by visiting my notes page.\n\nOutside studies, I enjoy travelling and taking photos. I grew up in Osaka, Japan before moving to the UK in 2022 for university, where my off-term address is currently.\n\nI originally created this web template in September 2025, to make a clean portfolio for myself. This site itself was launched July 2022. For details on how this site functions, you can see the first blog on this page.",
    "profile_picture": "images/profile.jpg",
    "profile_alt": "Tadayoshi Kamegai - Academic Profile Picture"
  },
  "contact": {
    "email": "tadayoshi [dot] kamegai [at] merton [dot] ox [dot] ac [dot] uk",
    "institution": "University of Oxford",
    "location": "Term Time: Oxford, UK | Off Term: Osaka, Japan"
  },
  "navigation": {
    "brand": "Apiros3",
    "items": [
      {
        "name": "About",
        "url": "./index.html",
        "current": true
      },
      {
        "name": "Publications / Talks", 
        "url": "publications/index.html",
        "current": false
      },
      {
        "name": "Blog",
        "url": "posts/index.html", 
        "current": false
      },
      {
        "name": "Notes / Paper Summaries",
        "url": "notes-page/index.html",
        "current": false
      },
      {
        "name": "Reading List",
        "url": "reading-list/index.html",
        "current": false
      }
    ]
  },
  "recent_posts": {
    "title": "Recent Blog Posts",
    "limit": 5,
    "show_abstract": false,
    "show_tags": false
  },
  "notes": {
    "title": "Notes / Paper Summaries",
    "description": "A curated collection of my notes and paper summaries. These include notes for lectures, seminars, and conferences, and also summaries of papers I have read / reading. Papers I plan to read are usually on the reading list page."
  },
  "reading_list": {
    "title": "Reading List",
    "description": "A collection of books, papers, and resources that I'm currently reading, have completed, or plan to read. This list reflects my current / previous interests (from September 2025), but also acts as a memo for things I can read when I have free time. I have written summaries for certain papers, which should be on the notes page."
  }
}
